# 가설검정
## 예제 6.4
어느 창구의 고객 대기 시간은 평균 11분이라고 알려져 있다. 특정 시간대의 고객 대기 시간은 정규분포를 따른다고 가정하여 표본을 얻은 결과는 아래와 같다.  
a=0.05로 하고 특정 시간대의 고객 대기시간은 11분인지 검정하라.

In [1]:
import numpy as np
import pandas as pd

In [2]:
wait_time = [8, 10, 10, 7, 9, 12, 10, 8, 7, 9]
wait_time = np.array(wait_time)
wait_time

array([ 8, 10, 10,  7,  9, 12, 10,  8,  7,  9])

In [3]:
mean = wait_time.mean()
var = ((wait_time - mean)**2).sum() / (len(wait_time) - 1)
std = np.sqrt(var)

t_value = (mean - 11) / (std/ np.sqrt(len(wait_time)))
t_value

-4.0451991747794525

In [4]:
# scipy패키지를 통해 검정한 결과 위와 똑같은 결과가 나옴
from scipy import stats
wait_test = stats.ttest_1samp(wait_time, 11)
print("T-value = %.3f, p-value = %.3f" % wait_test)

T-value = -4.045, p-value = 0.003

## 예제 6.6 - 두 모집단 간의 차에 대한 검정
철 함유량을 추정하는 데 화학적 분석 방법과 X선 분석 방법의 차이가 있는지를 알아보고자 한다. 다섯 개의 표본을 둘로 쪼개서 한 조각에는 화학적 분석 방법을 사용하였고,  
다른 한 조각에는 X선 분석방법을 사용하여 철 함유량을 측정하였으며 그 결과는 다음과 같다.

In [5]:
x = np.array([
    2.0, 2.0, 2.3, 2.1, 2.4, 2.2, 1.9, 2.5, 2.3, 2.4
])
g= np.repeat(np.array(["A", "B"]), 5)

d= {"g" : g, "x" : x}
d

{'g': array(['A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B'], dtype='<U1'),
 'x': array([2. , 2. , 2.3, 2.1, 2.4, 2.2, 1.9, 2.5, 2.3, 2.4])}

In [6]:
data = pd.DataFrame(data=d)
data

   g    x
0  A  2.0
1  A  2.0
2  A  2.3
3  A  2.1
4  A  2.4
5  B  2.2
6  B  1.9
7  B  2.5
8  B  2.3
9  B  2.4

In [7]:
A = data[data.g=="A"]
B = data[data.g=="B"]

data.groupby("g")["x"].describe()

   count  mean       std  min  25%  50%  75%  max
g
A    5.0  2.16  0.181659  2.0  2.0  2.1  2.3  2.4
B    5.0  2.26  0.230217  1.9  2.2  2.3  2.4  2.5

In [8]:
# 정규성 검정
from scipy.stats import shapiro

shapiro(x)
# p값이 0.59로 귀무가설을 기각할 수 없다. 그렇기 떄문에 자료는 정규분포를 따른다.

ShapiroResult(statistic=0.9437553882598877, pvalue=0.595504641532898)

In [9]:
# 등분산 검정(정규성을 만족할 때)
from scipy import stats

stats.bartlett(A.x, B.x)

BartlettResult(statistic=0.19769157819919453, pvalue=0.6565906251784377)

In [10]:
# 등분산 검정-Levene 검정(정규성을 만족하지 않을 때)
stats.levene(A.x, B.x)

LeveneResult(statistic=0.05555555555555569, pvalue=0.8195856784525775)

In [11]:
# T검정 - 양측검정, 등분산 가정
from scipy.stats import ttest_ind
ttest_ind(A.x, B.x, equal_var=True)

Ttest_indResult(statistic=-0.7624928516630208, pvalue=0.4676497723369858)

In [12]:
from statsmodels.stats.weightstats import ttest_ind

ttest_ind(A.x, B.x, alternative="larger", usevar="pooled")

(-0.762492851663024, 0.766175113831508, 8.0)

## 예제 6.7 - 짝으로 된 자료에 대한 검정
가공식품에는 다양한 식품첨가물이 사용되는데 오랫동안 보존하기 위한 보존료로는 소르빈산이 대표적으로 사용된다.  
버지니아 대학의 식품영양학과에서는 가공햄의 저장 전후에 따른 소르빈산 잔여량을 조사하였다.  
저장 전의 햄의 소르빈산 잔여량을 측정하고, 저장하여 60일이 지난 뒤 소르빈산 잔여량을 측정하였으며 그 결과는 다음과 같다.

In [13]:
x = np.array([224,270,400,444,590,660,1400,680])
y = np.array([116,96,239,329,437,597,689,576])

d= {"y":y, "x":x}
data=pd.DataFrame(data=d)
data

     y     x
0  116   224
1   96   270
2  239   400
3  329   444
4  437   590
5  597   660
6  689  1400
7  576   680

In [14]:
from scipy.stats import ttest_rel

ttest_rel(x,y)

Ttest_relResult(statistic=2.673117820270042, pvalue=0.031855388760108426)

In [15]:
pval=ttest_rel(x,y)[1]
print("one-sided p-value=", pval/2)

one-sided p-value= 0.015927694380054213

## 예제6.9 - 두 모집단 비율들의 차에 대한 검정
어느 회사 제품의 시장 점유율이 A 지역과 B 지역 간의 차이가 있는지 알아보고자 한다.  
A 지역, B 지역 각 80명씩 조사한 결과 A 지역은 56명, B 지역은 44명이 이 회사 제품을 사용하고 있을 때,  
A 지역의 시장점유율이 B 지역보다 높다고 할 수 있는가?

In [16]:
data = pd.DataFrame([[56,24],
                    [44,37]], index=["A", "B"], columns=["use", "unuse"])
data

   use  unuse
A   56     24
B   44     37

In [17]:
from scipy.stats import fisher_exact

fisher_exact(data, alternative="greater")

(1.9621212121212122, 0.02928955724688188)

# 범주형 자료에 대한 분석

## 예제 7.1 - 적합도 검정
한 자동차회사에서는 다섯 가지의 색상을 ㅗ승용차를 판매를 계획하고 A 색상 30%, B 색상 15%, C 색상 10%, D 색상 25%, E 색상 20%의 비율로 하기로 하였다.  
그리고 250명의 고객층을 대상으로 (A, B, C, D, E) 색상 중 선호색상에 대한 자료를 얻어 고객들의 선호색상 분포가 자동차회사의 계획 비율에 적합한가를 알아보고자 한다.

In [18]:
x = np.array([90,30,35,55,40])
e_x = np.array([0.3,0.15,0.1,0.25,0.2]) * 250

In [19]:
from scipy.stats import chisquare
sta, pvalue =  chisquare(x, e_x)
print(sta, pvalue)

11.4 0.02241796856505753

## 예제 7.4 - 독립성 검정
어느 카드 회사에서는 고객의 등급(A, B, C, D)과 카드 사용액이 관련이 있을 것으로 생ㄱ가하여 독립성 검정을 하기 위해 다음과 같은 분할표를 얻었다.  
즉 860명 고객의 사용액과 고객 등급을 조사하여 사용액은 다섯 가지, 고객 등급은 네가지로 나누어 정리하였다.

In [20]:
data = pd.read_csv("./book_data/ex7-4.csv")

In [21]:
pd.crosstab(index=data["amount"], columns=data["level"], values=data["count"], aggfunc=sum, margins=True, margins_name="전체")

level      A    B    C   D   전체
amount
10under   21   42   60   5  128
10~20     15  122   45  14  196
20~40     94  100   16  30  240
40~70    120   65   20  18  223
70upper   32    9   12  20   73
전체       282  338  153  87  860

In [22]:
pd.crosstab(index=data["amount"], columns=data["level"], values=data["count"], aggfunc=sum, margins=True, margins_name="전체", normalize="index").round(4)

level         A       B       C       D
amount
10under  0.1641  0.3281  0.4688  0.0391
10~20    0.0765  0.6224  0.2296  0.0714
20~40    0.3917  0.4167  0.0667  0.1250
40~70    0.5381  0.2915  0.0897  0.0807
70upper  0.4384  0.1233  0.1644  0.2740
전체       0.3279  0.3930  0.1779  0.1012

In [23]:
#카이제곱 검정 및 기대도수표 작성
from scipy.stats import chi2_contingency

d_table = pd.crosstab(index=data["amount"], columns=data["level"], values=data["count"], aggfunc=sum, margins=True, margins_name="전체")
d_table

level      A    B    C   D   전체
amount
10under   21   42   60   5  128
10~20     15  122   45  14  196
20~40     94  100   16  30  240
40~70    120   65   20  18  223
70upper   32    9   12  20   73
전체       282  338  153  87  860

In [24]:
chi, p, df, expected = chi2_contingency(d_table)

expected_table = pd.DataFrame(data=expected, index=d_table.index, columns=d_table.columns)
expected_table

level             A           B           C          D     전체
amount
10under   41.972093   50.306977   22.772093  12.948837  128.0
10~20     64.269767   77.032558   34.869767  19.827907  196.0
20~40     78.697674   94.325581   42.697674  24.279070  240.0
40~70     73.123256   87.644186   39.673256  22.559302  223.0
70upper   23.937209   28.690698   12.987209   7.384884   73.0
전체       282.000000  338.000000  153.000000  87.000000  860.0

In [25]:
print(chi, p)

252.05782411526025 4.392425562427717e-42

## 예제 7.5 - 동질성 검정
어느 공장은 근무 시간대에 따른 불량률이 모두 같은지를 알아보기 위하여 다음과 같은 자료를 얻었다.  
여기서 분석 목적은 세 작업 시간대에 따른 불량품 분포가 비슷한가를 알아보기 위한 것이므로 동질성 검정에 해당한다.

In [27]:
time = np.tile(["day", "evening", "night"], 2)
count = np.array([905, 890, 870, 45, 55, 70])
goods = np.repeat(["O", "X"], 3)
data = {"time" : time, "goods" : goods, "count" : count }
data

{'time': array(['day', 'evening', 'night', 'day', 'evening', 'night'], dtype='<U7'),
 'goods': array(['O', 'O', 'O', 'X', 'X', 'X'], dtype='<U1'),
 'count': array([905, 890, 870,  45,  55,  70])}

In [29]:
d_table = pd.crosstab(index=data["goods"], columns=data["time"] ,
                    values=data["count"], aggfunc=sum, margins=True, margins_name="전체" )
d_table

col_0  day  evening  night    전체
row_0
O      905      890    870  2665
X       45       55     70   170
전체     950      945    940  2835

In [30]:
chi, p, df, expected = chi2_contingency(d_table)

In [32]:
print(chi.round(4), p.round(4))

6.2339 0.3975

## 예제 8.1 - 일원배치분산분석

In [34]:
data = pd.read_csv("./book_data/ex8-1.csv")
data.head()

   sample aggregate    y
0       1        a1  551
1       2        a1  457
2       3        a1  450
3       4        a1  731
4       5        a1  499

In [35]:
data.groupby("aggregate")["y"].describe()

           count        mean         std    min     25%    50%     75%    max
aggregate
a1           6.0  553.333333  110.153832  450.0  467.50  525.0  611.75  731.0
a2           6.0  569.333333   47.986109  508.0  532.75  581.5  592.00  633.0
a3           6.0  610.500000   59.945809  511.0  583.50  627.0  645.75  677.0
a4           6.0  465.166667   57.607002  415.0  422.25  443.5  500.00  555.0
a5           6.0  610.666667   58.783218  522.0  575.50  622.0  649.75  679.0

In [36]:
import statsmodels.api as sm
import statsmodels.formula.api as smf

fit = smf.ols("y ~ aggregate", data).fit()
sm.stats.anova_lm(fit, typ=1)

             df         sum_sq       mean_sq         F    PR(>F)
aggregate   4.0   85356.466667  21339.116667  4.301536  0.008752
Residual   25.0  124020.333333   4960.813333       NaN       NaN

## 예제 8.2 - 반복이 없는 이원배치분산분석
어느 공장에서는 4대의 서로 다른 조립기계와 6명의 작업자에 따라 작업속도에 차이가 있는지 알아보기 위하여 분산분석을 수행하고자 한다.  
또한 작업자의 숙련도에 따라서도 작업 속도가 차이가 있을 것으로 기대된다.  
각 작업자에게 무작위의 순서로 기계를 할당하였으며 제품 조립 시간을 초단위로 기록하였고, 그 자료는 다음과 같이 주어진다.

In [37]:
data = pd.read_csv("./book_data/ex8-2.csv")
data.head()

   A  B     Y
0  1  1  42.5
1  2  1  39.8
2  3  1  40.2
3  4  1  41.3
4  1  2  39.3

In [38]:
import statsmodels.api as sm
import statsmodels.formula.api as smf

fit = smf.ols("Y~C(A)+C(B)", data).fit()
sm.stats.anova_lm(fit, typ=1)

            df     sum_sq   mean_sq         F    PR(>F)
C(A)       3.0  15.924583  5.308194  3.338779  0.047904
C(B)       5.0  42.087083  8.417417  5.294435  0.005328
Residual  15.0  23.847917  1.589861       NaN       NaN

예제 8.3 - 반복이 있는 이원배치분산분석
광고효과를 측정하기 위하여 10가지 변수를 사용한다. 이 10가지 변수의 합을 광고효과 점수라고 하자.  
어느 상품의 광고효과는 프로그램에 따라 그리고 시사 횟수에 따라 다른가를 알아보기 위해 분산분석을 수행하기로 하였다.  
광고 효과 점수는 정규분포를 따른다는 전제하에 시사 횟수와 프로그램의 6가지 처리에 대해 각 두명씩 대상을 얻은 광고효과 점수는 다음과 같다.

In [39]:
data = pd.read_csv("./book_data/ex8-3.csv")
data.head()

         program  number   y
0           news      10  47
1           news      10  43
2          drama      10  62
3          drama      10  68
4  entertainment      10  41

In [41]:
import statsmodels.api as sm
import statsmodels.formula.api as smf

fit = smf.ols("y~program+C(number)+program*C(number)", data).fit()
sm.stats.anova_lm(fit, typ=1)

                    df  sum_sq     mean_sq          F    PR(>F)
program            2.0  1544.0  772.000000  74.709677  0.000058
C(number)          1.0    12.0   12.000000   1.161290  0.322605
program:C(number)  2.0    24.0   12.000000   1.161290  0.374697
Residual           6.0    62.0   10.333333        NaN       NaN